[
    {
        "movieID" : "64b1658a0e7269de65deefd8",
        "plot" : "The Asgardian Loki encounters the Other, the leader of an extraterrestrial race known as the Chitauri. In exchange for retrieving the Tesseract,[c] a powerful energy source of unknown potential, the Other promises Loki an army with which he can subjugate Earth. Nick Fury, director of the espionage agency S.H.I.E.L.D., arrives at a remote research facility, where physicist Dr. Erik Selvig is leading a team experimenting on the Tesseract. The Tesseract suddenly activates and opens a wormhole, allowing Loki to reach Earth. Loki steals the Tesseract and uses his scepter to enslave Selvig and other agents, including Clint Barton, to aid him.In response, Fury reactivates the 'Avengers Initiative'. Agent Natasha Romanoff heads to Kolkata to recruit Dr. Bruce Banner to trace the Tesseract through its gamma radiation emissions. Fury approaches Steve Rogers to retrieve the Tesseract, and Agent Phil Coulson visits Tony Stark to have him check Selvig's research. Loki is in Stuttgart, where Barton steals the iridium needed to stabilize the Tesseract's power, leading to a confrontation with Rogers, Stark, and Romanoff that ends with Loki's surrender. While Loki gets escorted to S.H.I.E.L.D., his adoptive brother Thor arrives and frees him, hoping to convince him to abandon his plan and return to Asgard. Stark and Rogers intervene and Loki is taken to S.H.I.E.L.D.'s flying aircraft carrier, the Helicarrier, where he is imprisoned.The Avengers become divided over how to approach Loki and the revelation that S.H.I.E.L.D. plans to harness the Tesseract to develop powerful weapons as a deterrent against hostile extraterrestrials. As they argue, Loki's agents attack the Helicarrier, and the stress causes Banner to transform into the Hulk. Stark and Rogers work to restart the damaged engine, and Thor attempts to stop the Hulk's rampage. Romanoff knocks Barton unconscious, breaking Loki's mind control. Loki escapes after killing Coulson and Fury uses Coulson's death to motivate the Avengers into working as a team. Loki uses the Tesseract and a wormhole generator Selvig built to open a wormhole above Stark Tower to the Chitauri fleet in space, launching his invasion.Rogers, Stark, Romanoff, Barton, Thor, and the Hulk rally in defense of New York City, and together the Avengers battle the Chitauri. The Hulk beats Loki into submission. Romanoff makes her way to the generator, where Selvig, freed from Loki's mind control, reveals that Loki's scepter can shut down the generator. Fury's superiors from the World Security Council attempt to end the invasion by launching a nuclear missile at Midtown Manhattan. Stark intercepts the missile and takes it through the wormhole toward the Chitauri fleet. The missile detonates, destroying the Chitauri mothership and disabling their forces on Earth. Stark's suit loses power and he goes into freefall, but the Hulk saves him, while Romanoff uses Loki's scepter to close the wormhole. In the aftermath, Thor returns with Loki and the Tesseract to Asgard, where Loki will face their justice.In a mid-credits scene, the Other confers with his master[d] about the failed attack on Earth."
    },
    {
        "movieID" : "64b165d10e7269de65df6783",
        "plot" : "The film opens in Medina during the time of the Islamic prophet Muhammad, 627 AD. Abu Ayyub tells other sahabas that Constantinople will be conquered by a blessed commander and army.The story shifts abruptly to the 15th century. Sultan Muhammad al-Fatih was given the throne by his father Murad II when he was 12; he learns of his father's death while governing the Sanjak of Saruhan. This causes him much grief and paves the way for his ascension to the throne again, after the death of his brother Fathıl IV. When Sultan Mehmet had first ascended the throne, he was also 12 years old. Murad II, suffocated by the political hostility of his margraves and viziers, relinquished the throne due to the impact of his deep grief caused by his beloved son Mohamed's death and enthroned Mehmet. Grand Vizier Halil Pasha, who had a great influence on the Janissaries and the state, was dissatisfied because of this situation. He was especially troubled with Sultan Mehmet indicating that Constantinople's conquest is vitally essential. He made Sultan Murat inherit the throne again in anticipation of the possibility of crusaders occupying Ottoman territories by taking advantage of Mehmet. Mehmet was suspended from the throne and sent to the Sanjak of Saruhan.Now, Mehmet succeeds to the throne again and is even more powerful. His priority target is still the conquest of Constantinople. He gains inspiration from the words of Muhammad: “Constantinople will surely be conquered. What a blessed commander is its and what a blessed army is its army.”He works out everything that will take him to the target. At the outset, Mehmet decides that he should live in peace with contiguous countries until he makes the preparations for his campaign. He sends messengers to the Papal States, to the Kingdom of Hungary, to the Serbian Despotate, to the Kingdom of Poland, to the Republic of Genoa and to the Republic of Venice and notifies them of his intention to live in peace. He restores the dockyard of Gallipoli and because of this action, 100 galleys can be produced there in a year. Meanwhile, the Byzantine Emperor Constantine XI Palaiologos thinks that Sultan Mehmet is inexperienced and lacking in foresight. Constantine demands heavy appropriations, trying to use to his advantage his possession of the captive Prince Orhan. Constantine's main intention is to make Sultan Mehmet lose his reputation by capitulating to his demands. Sultan Mehmet appears to accept his demands, but this is just a strategy of deceit.As soon as the news of Karaman's rebellion is received, Ottoman armies set out for Akşehir. Karamanoğlu İbrahim was not expecting such a mighty army. He demands peace. Sultan Mehmet accepts the peace, because he does not want his armies to be harmed unnecessarily. After the military expedition, on the return journey, a group of janissaries confront the state tent and ask for payment. They had not actually engaged in battle. In response, Sultan Mehmet sends out enthronements. He also sends into exile the janissary master Kurtçu Doğan. The janissary was an ally of Grand Vizier Halil Pasha. With this incident, Mehmet properly gains dominion over his armies.Following his return to Adrianople, Mehmet sends a messenger to Emperor Constantine and he declares that he will no longer send the subsidy for the continued captivity of Orhan. Following this incident, Mehmet starts to build the Boğazkesen (Rumelian) Fortress across the Anatolian Fortress. He fully intends to wage war against the Byzantine Empire.On 29 May 1453, the Byzantine soldiers on the ramparts are overwhelmed while facing Sultan Mehmet and his army"
    },
    {
        "movieID" : "63e2b030b2c46863630b02df",
        "plot" : "34kXNDdAvJA"
    },
    {
        "movieID" : "63e2b030b2c46863630b02dd",
        "plot" : "A nude humanoid alien lands on Earth on a research mission in Rajasthan but is stranded when the remote control for his spaceship is stolen. He manages to get the thief's cassette recorder. On the same day in Belgium, an Indian woman, Jagat Janani Sahni alias Jaggu, meets a Pakistani, Sarfaraz Yousuf, and falls in love with him. Jaggu's father objects to their relationship, citing difference in their religions. He consults godman Tapasvi Maharaj who predicts that Sarfaraz will betray Jaggu. Determined to prove them wrong, Jaggu asks Sarfaraz to marry her. At the wedding, she is heartbroken when she receives an unsigned letter, believing it is from Sarfaraz, calling off the wedding due to cultural differences.Jaggu returns to India and becomes a news reporter. She meets the alien and is intrigued to see him distribute leaflets about the 'missing' God. She earns his trust by rescuing him when he attempts to take money from a temple's collection box as a refund on God's broken promises. The alien tells her that he is an 'astronaut' from another planet. His people know nothing about dressing, religion, or verbal communication; they transfer ideas by holding hands.A flashback shows how, after being accidentally hit by a truck, the alien is befriended by bandmaster Bhairon Singh, who takes him along with his troop. Bhairon takes him to a brothel, where the alien holds a prostitute Phuljhadiya's hand for six hours and thus learns the Bhojpuri language. The alien begins speaking, and after learning of the whole scenario, Bhairon tells him that his thief may be in Delhi. The alien leaves for Delhi. Due to his strange behaviour, people assume he is drunk and call him 'peekay' or 'PK' (Hindi for drunk); the alien adopts PK as a name (his people have no language and thus no names). People tell PK that only 'God' can help him find his remote. He sincerely practices Indian religions, including Hinduism, Sikhism, Christianity and Islam, attempting to find 'God', to no avail. He later discovers that Tapasvi has his remote, who claims it was a gift from God and refuses to return it. Jaggu promises PK that she will recover his remote and he can go back home.PK conjectures, as Jaggu plays a prank on an unknown caller, that Tapasvi and other godmen must be dialling a 'wrong number' to communicate with God and are advising the public to engage in meaningless rituals. Jaggu encourages the public to expose fraudulent godmen by sending their videos to her news channel. This 'wrong number' campaign turns into a popular mass movement, to the dismay of Tapasvi. Meanwhile, Bhairon finds the thief and contacts PK, telling him that he sold his remote to Tapasvi. PK realises that Tapasvi was a fraud all along and that it was not a 'wrong number'. Bhairon brings the thief to Delhi, but both die in a terrorist attack.Tapasvi decides to confront PK on-air. Tapasvi asks PK what the 'right number' is. PK says that 'God created us all' is the only concept people should believe in and that the other 'duplicate Gods' are artificial. Tapasvi argues, saying that PK is trying to take people away from their Gods and that they will not stand for their Gods being taken away. He claims he has a direct connection to God and refers to his prediction of Sarfaraz's betrayal to try to prove that Muslims are liars. PK, having absorbed Jaggu's memories earlier, realises that Sarfaraz did not write the letter to Jaggu.Jaggu contacts the Pakistani Embassy in Belgium where Sarfaraz worked part-time. The embassy receptionist tells her that Sarfaraz has been annoying the embassy officials by repeatedly asking if they received a call from Delhi, implying that he still loves Jaggu. That day, Sarfaraz found the same letter and thought it was from Jaggu, and did not call her as he understood she was under familial pressure. Jaggu and Sarfaraz reconnect, and Tapasvi is forced by Jaggu's father to return PK's remote.Meanwhile, PK has fallen in love with Jaggu but refrains from telling her because she loves Sarfaraz. Having filled multiple audio tapes with her voice alone, he takes two suitcases full of tapes and extra batteries when leaving for home. He lies to Jaggu that the tapes contain a variety of Earthly noises which he will miss, such as crows and car horns. Jaggu realises his love for her by seeing the note he wrote for her earlier but does not directly confront him about it. PK does not even look back while going as he does not want her to see him in tears which will give away his love for her. After his departure, Jaggu publishes a book about him, with Sarfaraz and her family assisting.One year later, PK returns to Earth on a new research mission on human nature with more members of his species"
    },
    {
        "movieID" : "63e2b030b2c46863630b02de",
        "plot" : "After their flight is canceled due to stormy weather, neurosurgeon Dr. Ben Bass (Idris Elba) and photojournalist Alex Martin (Kate Winslet) hire private pilot Walter (Beau Bridges) to get them from Idaho to Denver for connecting flights to Alex's wedding in New York and Ben's emergency surgery appointment in Baltimore. Walter, who has not filed a flight plan, suffers a fatal stroke mid-flight, and the plane crashes on a mountaintop in the High Uintas Wilderness. Ben, Alex, and Walter's Labrador Retriever survive the crash but Alex has injured her leg quite badly. Ben attends to her cuts and injured knee, and buries the pilot while she is unconscious.Once conscious, Alex thinks Ben has a better chance of finding help if he leaves her behind, but Ben refuses. Stranded for days with dwindling supplies, Alex grows skeptical that they will be rescued, although Ben wants to wait for help with the plane's wreckage. He agrees to climb a ridge to see if there is any sign of a road, but sees nothing but mountains and narrowly avoids falling down the side.Alex goes through Ben's things and listens to a message from his wife saying, 'I'm glad to have had this time with you'. Alex is found by a cougar, who viciously fights and wounds the dog. She shoots a flare at the big cat, killing it. The dog returns and later, when Ben comes back he tends to the dog’s wounds. They cook the cougar's corpse giving them, Ben thinks, ten days of food.The two argue over waiting for rescue or descending the mountain to find help/a phone signal. Alex starts a lone descent down the mountain. Ben catches up, having located the tail end of the plane he finds a beacon - but it is smashed. The two hike down to the tree-line and spend the night in a cave.Using her telephoto lens, Alex thinks she sees a cabin. At the same time that Alex falls into freezing water, Ben comes across the empty cabin. He pulls her out, but she remains unconscious and severely dehydrated. Ben again saves her life by fashioning an IV. They stay there for several days while Alex recovers; Ben reveals that his wife died two years prior from a brain tumor. Eventually they have sex. As he sleeps, Alex takes his picture. Later, she again tells Ben to leave her behind to find help. Ben initially agrees but soon returns; they press forward again.The dog alerts them to a nearby timber yard. On their way toward it, Ben's leg gets caught in a bear trap. Alex cannot free him, but she reaches the yard and collapses in front of an approaching truck. Ben awakens in a hospital and goes to Alex's room, where he finds her with Mark (Dermot Mulroney), her fiancé. After a brief conversation, Ben leaves, heartbroken.Ben and Alex go their separate ways after the hospital, with Ben keeping the dog. Alex tries calling Ben, but he ignores her calls until she sends him photos she had taken on the mountain, writing that only he can understand them. This encourages Ben to call Alex. They meet at a restaurant in New York, where it is revealed that Alex is now a part-time teacher, and Ben is a consultant at trauma clinics in London because his frostbitten hands will not recover sufficiently for him to perform surgery again. Ben says he did not call Alex because he thought she had married; Alex says she could not go through with it because she fell in love with Ben. Outside the restaurant, Ben admits to Alex that they survived because they fell in love. Alex dismisses her feelings and reminds Ben of something he said on the mountain: 'the heart is just a muscle.' She tells him she does not know how they could be together in the real world. They hug goodbye, and begin to depart in opposite directions. While walking away both become distraught, and finally turn and begin running back to each other. A split second before the two embrace, the screen cuts to black and the credits roll."
    },
    {
        "movieID" : "63e2b030b2c46863630b02e0",
        "plot" : "In 1952 Romania, two nuns living at the Saint Cartha's monastery are attacked by an unseen evil force after one of them entered a tunnel to retrieve an ancient Christian relic. The surviving nun, Sister Victoria, flees from the attacker, a demon appearing as a nun, and hangs herself. Her body is discovered by Frenchie, a villager who transports supplies to the nuns.The Vatican learns of the incident and summons Father Burke to Rome, where they ask him to travel with Sister Irene, a nun in her novitiate, to Romania in order to investigate the situation. While Sister Irene is teaching children the relationship between religion and science in a school, her Mother Superior interrupts her and informs her that Burke has arrived in order to request Irene's accompaniment in his trip to Romania.The pair travel to Romania and meets with Frenchie, who leads them to the abbey. They discover Victoria's body and take a key from her corpse. Inside, they encounter the Abbess, who informs them that the nuns observe a period of silence during the night and offers them lodging at the attached convent if they wish to return tomorrow. Frenchie is attacked by a demon as he returns to the village, but escapes. Burke tells Irene that a boy he exorcised in the past, Daniel, was fatally injured during the ritual, and Burke has carried the burden of the boy's death. Irene reveals that as a girl, she had visions and each of them concluded with 'Mary points the way', causing the Church to take an interest in her. That night, Burke is rescued by Irene after being buried alive in the graveyard by the demonic entity.The next day, Irene and Burke return to the abbey, but only Irene can enter as it is cloistered. She meets some of the other nuns and learns that they are praying constantly, swapping in shifts, to keep the entity at bay. Sister Oana reveals the abbey was built in the Dark Ages as a castle to be used by the Duke of St. Carta, a powerful aristocrat obsessed with the occult. The duke summoned the demon through a rift in the catacombs but was killed by Christian knights, who sealed the rift with a vial filled with the Blood of Christ. However, the bombings during World War II reopened the rift, unleashing the entity. Burke identifies the demon as Valak and discovers the Abbess has been dead all along.Frenchie heads back to the abbey to help Irene and Burke. Irene is attacked by Valak and joins the nuns in desperate prayer to ward off the demon. When the group reunites, Irene discovers that none of the nuns she had seen and talked to were real and she had been praying alone, later realizing that Sister Victoria had been the last nun in the abbey and had sacrificed herself to stop Valak from possessing her body and unleashing evil.Theorizing that Valak can only be stopped if they seal the rift with the blood of Christ contained in the reliquary, the trio retrieves the vial with the key Victoria possessed. Irene informs Burke that God has called her to make her solemn vows as a nun and asks Burke to elevate her to the status of a professed nun, which he does in the abbey's chapel.After the trio unlocks the tunnel door, Irene is lured into a pentagram and possessed by Valak. Frenchie smears some of the blood of Christ on her face, casting out the demon. Burke is wounded by Daniel's ghost as Valak starts to drown Irene in a flooded chamber. Irene expels the blood of Christ in the demon's face, banishing it as the rift is sealed. After Frenchie resuscitates Irene, he reveals his name is Maurice. Unbeknownst to the others, Maurice has been possessed by Valak, as evidenced by an inverted crucifix on the back of his neck.Twenty years later at a university seminar in Wakefield, Massachusetts, Carolyn Perron watches as Ed and Lorraine Warren present footage of their attempt to exorcise a possessed Maurice. In the footage, Maurice grabs Lorraine, giving her visions of Ed dying, causing her to scream in horror and lock herself in her bedroom for eight days, which initiates the Warrens' investigation of the Perron farmhouse haunting."
    },
    {
        "movieID" : "63e2b030b2c46863630b02e1",
        "plot" : "In Season 1 name is Rise of Empires: Ottoman, Sultan Mehmed the Conqueror wages a campaign to take the Eastern Roman capital of Constantinople in 1453, resulting in the capture of the city and establishment of the Ottoman Empire.In Season 2 name is Mehmed and Vlad, Mehmed the Conqueror and Vlad the Impaler, childhood companions in the Ottoman court, go head-to-head in the 1462 Ottoman invasion of Wallachia."
    },
    {
        "movieID" : "63e2b030b2c46863630b02e2",
        "plot" : "Tony Stark, who has inherited the defense contractor Stark Industries from his late father Howard Stark, is in war-torn Afghanistan with his friend and military liaison, Lieutenant Colonel James Rhodes, to demonstrate the new 'Jericho' missile. After the demonstration, his convoy is ambushed and Stark is critically wounded by a missile used by the attackers—one of his company's own. He is captured and imprisoned in a cave by a terrorist group called the Ten Rings. Yinsen, a fellow captive and doctor, implants an electromagnet into Stark's chest to keep the shrapnel shards that wounded him from reaching his heart and killing him. Ten Rings leader Raza offers Stark freedom in exchange for building a Jericho missile for the group, but he and Yinsen believe that Raza will not keep his word.Stark and Yinsen secretly build a small, powerful electric generator called an arc reactor to power Stark's electromagnet and a prototype suit of powered armor to aid in their escape. Although they keep the suit hidden almost to completion, the Ten Rings discover their hostages' intentions and attack the workshop. Yinsen sacrifices himself to divert them while the suit powers up. The armored Stark battles his way out of the cave to find the dying Yinsen, then burns the Ten Rings' weapons and flies away, crashing in the desert and destroying the suit. After being rescued by Rhodes, Stark returns home and announces that his company will cease manufacturing weapons. Obadiah Stane, his father's old partner and the company's manager, advises Stark that this may ruin Stark Industries and his father's legacy. In his home workshop, Stark builds a sleeker, more powerful version of his improvised armor suit as well as a more powerful arc reactor for it and his chest. Personal assistant Pepper Potts places the original reactor inside a small glass showcase. Though Stane requests details, a suspicious Stark decides to keep his work to himself.At a charity event held by Stark Industries, reporter Christine Everhart informs Stark that his company's weapons were recently delivered to the Ten Rings and are being used to attack Yinsen's home village, Gulmira. Stark dons his new armor and flies to Afghanistan, where he saves the villagers. While flying home, Stark is attacked by two F-22 Raptors. He reveals his secret identity to Rhodes over the phone in an attempt to end the attack. Meanwhile, the Ten Rings gather the pieces of Stark's prototype suit and meet with Stane, who has been trafficking arms to the Ten Rings and has staged a coup to replace Stark as Stark Industries' CEO by hiring the Ten Rings to kill him. He subdues Raza and has the rest of the group killed. Stane has a massive new suit reverse-engineered from the wreckage. Seeking to track his company's illegal shipments, Stark sends Potts to hack into its database. She discovers that Stane hired the Ten Rings to kill Stark, but the group reneged when they realized they had a direct route to Stark's weapons. Potts meets with Agent Phil Coulson of S.H.I.E.L.D., an intelligence agency, to inform him of Stane's activities.Stane's scientists cannot duplicate Stark's miniaturized arc reactor, so Stane ambushes Stark at his home and steals the one from his chest. Stark manages to replace it with his original reactor. Potts and several S.H.I.E.L.D. agents attempt to arrest Stane, but he dons his suit and attacks them. Stark fights Stane but is outmatched without his new reactor to run his suit at full capacity. The fight carries Stark and Stane to the top of the Stark Industries building, where Stark instructs Potts to overload the large arc reactor powering the building. This unleashes a massive electrical surge that causes Stane and his armor to fall into the exploding reactor, killing him. The next day, at a press conference, Stark publicly admits to being the superhero the press has dubbed 'Iron Man'.In a post-credits scene, S.H.I.E.L.D. director Nick Fury visits Stark at home, telling him that Iron Man is not 'the only superhero in the world', and explaining that he wants to discuss the 'Avenger Initiative'."
    },
    {
        "movieID" : "63e2b030b2c46863630b02e3",
        "plot" : "A dollmaker named Samuel Mullins and his wife Esther grieve for the loss of their seven-year-old daughter Annabelle, nicknamed 'Bee', who dies when she accidentally steps in front of a car.Twelve years later, the Mullins open their home to provide shelter for Sister Charlotte and six girls left homeless by the closing of their orphanage. Despite having been warned to avoid Bee's locked bedroom, Janice, a young orphan disabled by polio, discovers a note saying 'Find me' and sneaks into the room, which has mysteriously become unlocked. She finds a key for Bee's closet and opens it, where she sees an eerie porcelain doll. This unwittingly releases a powerful demon that begins to terrorize the girls.One night, the demon, taking Bee's form, appears to Janice, saying that it wants her soul. Although she attempts to get away using a stairlift, the demon recalls the stairlift and hurls her violently down to the ground floor, leaving her severely injured and confined to a wheelchair. Janice's best friend Linda is tormented by the demon. One morning, the demon, posing as Sister Charlotte, wheels Janice into the old barn, where, in the form of Bee, it attacks and possesses her after throwing up black bile directly into Janice's mouth. Linda notices changes in Janice's behavior and tells Samuel that Janice snuck into Bee's room and found the doll. Samuel trusts Linda. Janice, who can now walk, transforms into the demon and brutally kills Samuel who follows her while holding a crucifix, forcing him to drop it after moving his fingers backwards one by one. Outside, Sister Charlotte hears his screams and is horrified to find him dead on the floor.Linda takes Janice's doll and throws it into the well. A strange noise comes from the well and she is almost dragged into it, but Sister Charlotte saves her. Alarmed, Sister Charlotte speaks with the disfigured Esther, who is confined to her bedroom. Esther explains that after Bee's death, they prayed to whatever entity would grant their wish to see their daughter again. An unknown entity answered their prayer and though they briefly saw Bee's spirit, the entity convinced them to transfer its essence into one of Samuel's crafted dolls. They happily agreed but soon realized they had attracted a demon looking for a human host. One night, Esther saw Bee's spirit transforming into the demon, which then gouged out her eye and resulted in her wearing a half doll-like mask to conceal her injury and the scars. Enlisting the help of priests to bless the house, they locked the doll in Bee's closet. Esther and Samuel opened their house as a shelter for orphan children to repent for their actions, but Esther now regrets it since this has provided an opportunity for the demon to look for a human host.The demon murders Esther and attacks Sister Charlotte. The orphans leave the house, but Linda is trapped and hides in Bee's room as the possessed Janice tries to stab her. Sister Charlotte locks Janice and the doll inside the closet. The next day, police arrive to search the house and find only the doll, which they remove as evidence. Sister Charlotte, Linda, and the orphans are escorted away by officers to find another new home for the orphans, while Janice escapes through a hole in the closet wall and relocates to an orphanage in Santa Monica. Still possessed, she becomes reclusive and calls herself Annabelle. Pete and Sharon Higgins soon adopt Annabelle.Twelve years later, after being involved in devil worship, a grown-up Annabelle returns home and murders her adoptive parents, awakening Mia, who warns John about Sharon Higgins's screams.Cast"
    }
]